//对于长度为5位的一个01串，每一位都可能是0或1，一共有32种可能。它们的前几个是：
//00000
//00001
//00010
//00011
//00100
//
//请按从小到大的顺序输出这32种01串。
//【输入形式】
//本试题没有输入。
//【输出形式】
//00000
//00001
//00010
//00011
//00100
//00101
//< 以下部分省略 >
#include<iostream>
using namespace std;
int main1() {
	int output[5] = { 0 };
	for (int i = 1; i <= 32; i++) {
		if (i % 2 == 1)
			output[0] = 0;
		else output[0] = 1;
		if (i % 4 == 1 || i % 4 == 2)
			output[1] = 0;
		else output[1] = 1;
		if (i % 8 == 1 || i % 8 == 2 || i % 8 == 3 || i % 8 == 4)
			output[2] = 0;
		else output[2] = 1;
		if (i % 16 == 1 || i % 16 == 2 || i % 16 == 3 || i % 16 == 4 ||
			i % 16 == 5 || i % 16 == 6 || i % 16 == 7 || i % 16 == 8 )
			output[3] = 0;
		else output[3] = 1;
		if (i % 32 == 1 || i % 32 == 2 || i % 32 == 3 || i % 32 == 4 ||
			i % 32 == 5 || i % 32 == 6 || i % 32 == 7 || i % 32 == 8 ||
			i % 32 == 9 || i % 32 == 10|| i % 32 == 11|| i % 32 == 12||
			i % 32 == 13|| i % 32 == 14|| i % 32 == 15|| i % 32 == 16)
			output[4] = 0;
		else output[4] = 1;
		for (int j = 4; j >= 0; j--) {
			cout << output[j];
		}
		cout << endl;
	}
	return 0;
}